In [2]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [3]:
df = pd.read_csv('../data/net-migration-figures.csv')

In [4]:
df.head()

   Year All Nationalities  British      EU+ Non-EU+
0  2012           195,000  -72,000  206,000  61,000
1  2013           244,000  -81,000  262,000  63,000
2  2014           284,000  -80,000  277,000  87,000
3  2015           303,000  -73,000  287,000  88,000
4  2016           249,000  -94,000  253,000  90,000

In [20]:
df.dtypes

Year                  int64
All Nationalities    object
British              object
EU+                  object
Non-EU+              object
dtype: object

In [21]:
for col in df.columns:
    if col != 'Year':
        df[col] = df[col].str.replace(',', '').astype(int)

In [22]:
df.head()

   Year  All Nationalities  British     EU+  Non-EU+
0  2012             195000   -72000  206000    61000
1  2013             244000   -81000  262000    63000
2  2014             284000   -80000  277000    87000
3  2015             303000   -73000  287000    88000
4  2016             249000   -94000  253000    90000